# Taps
# -----------------------------------------------------------------------------
# tap "d12frosted/emacs-plus"
tap "fluxcd/tap"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kcl-lang/tap"
tap "SoloAntonio/cartero"

# Brews
# -----------------------------------------------------------------------------
# brew "fluxcd/tap/flux" # use concrete version for the cluster
# brew "emacs-plus"
brew "age"
brew "ansible"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "caddy"
brew "checkov"
brew "coreutils"
brew "cosign"
brew "cue"
brew "datamash"
brew "delve" # go debugger
brew "diffutils"
brew "dive"
brew "entr" # Run arbitrary commands when files change (I don't remember which program needs it)
brew "fd"
brew "findutils"
brew "fzf"
brew "gcc" # tree-sitter (neorg)
brew "gh"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "gnu-tar"
brew "gnuplot"
brew "go"
brew "go-jsonnet" # jsonnetfmt
brew "go-task"
brew "grep"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/vault"
brew "helix"
brew "helm"
brew "helm-docs"
brew "helm-ls"
brew "ipcalc"
brew "jless"
brew "jq"
brew "jsonnet-bundler" # for tanka
brew "k9s"
brew "kcl-lang/tap/kcl"
brew "kcl-lang/tap/kcl-lsp"
brew "kind"
brew "kubecolor"
brew "kubeconform"
brew "kubernetes-cli"
brew "lazygit"
brew "luarocks"
brew "minikube"
brew "mpv"
brew "nmap"
brew "node"
brew "openssl@3"
brew "pandoc"
brew "pass"
brew "pipenv"
brew "protobuf"
brew "python@3.11"
brew "rclone"
brew "riff"
brew "ripgrep"
brew "rust"
brew "skopeo"
brew "solana"
brew "sops"
brew "sox" # sound sample translator (gp.nvim)
brew "starship"
brew "syncthing"
brew "tanka"
brew "tealdeer"
brew "television"
brew "telnet"
brew "tenv"
brew "the_silver_searcher"
brew "tmux"
brew "tree"
brew "util-linux"
brew "uv" # https://github.com/astral-sh/uv
brew "vim"
brew "watch"
brew "websocat"
brew "wget"
brew "yq"

# Fonts
# -----------------------------------------------------------------------------
cask "font-hack"
cask "font-jetbrains-mono"
cask "font-source-code-pro"

cask "font-adwaita-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"

# Casks
# -----------------------------------------------------------------------------
cask "alacritty"
cask "calibre"
cask "cartero"
cask "cyberduck" # ftp client
cask "dbeaver-community"
cask "discord"
cask "docker-desktop"
cask "emacs-app"
cask "flameshot"
cask "gaphor" # SysML/UML modeling
cask "ghostty@tip"
cask "gimp"
cask "hammerspoon"
cask "kate"
cask "keepassxc"
cask "kitty"
cask "microsoft-remote-desktop"
cask "mitmproxy" # interactive HTTPS proxy to inspect traffic
cask "mongodb-compass"
cask "obsidian"
cask "qbittorrent"
cask "spotify"
cask "telegram"
cask "tigervnc-viewer"
cask "tunnelblick"
cask "utm"
cask "vlc"
cask "vscodium"
cask "wezterm@nightly"
cask "wireshark-app"

# Neovim
# -----------------------------------------------------------------------------
# brew "neovim"

# Formatters
brew "black"
brew "isort"
brew "prettier"
brew "prettierd"
brew "ruff"
brew "shfmt"
brew "stylua"
brew "taplo"
brew "yamlfmt"

# Linters
brew "ansible-lint"
brew "djlint"
brew "golangci-lint"
brew "proselint"
brew "shellcheck"
brew "tflint"
brew "typos-cli"
brew "yamllint"

# LSP
brew "rust-analyzer"
brew "basedpyright"
brew "bash-language-server"
brew "vscode-langservers-extracted"
brew "gopls"
brew "lua-language-server"
brew "marksman"
brew "ruff-lsp"
brew "templ"
brew "terraform-ls"
brew "typescript-language-server"
brew "yaml-language-server"


# MacOS App Store
# -----------------------------------------------------------------------------
brew "mas"
mas "Windows App (remote)", id: 1295203466
mas "Wireguard", id: 1451685025

# vim: ft=conf
