tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew-ffmpeg/ffmpeg"


brew "ansible"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bc"
brew "cairo" # required for pycairo
brew "cmake"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "fd"
brew "findutils"
brew "fzf"
brew "gawk"
brew "git"
brew "git-delta"
brew "git-flow"
brew "glow"
brew "gnu-sed"
brew "golang"
brew "gpg"
brew "grep"
brew "gron"
brew "htop"
brew "imagemagick"
brew "ipython"
brew "java"
brew "jq"
brew "lazygit"
brew "less"
brew "lesspipe"
brew "moreutils"
brew "mtr"
brew "mysql-client" # required for python package mysql-client
brew "neofetch"
brew "neovim"
brew "nmap"
brew "p7zip"
brew "pango" # required for python package cffi
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "telnet"
brew "tig"
brew "tmux"
brew "tree"
brew "util-linux"
brew "vim"
brew "watch"
brew "wget"
brew "xz"
brew "yq"
brew "zsh"


cask "alacritty"
cask "apache-directory-studio"
cask "bitwarden"
cask "cyberduck" # ftp client
cask "docker"
cask "firefox"
cask "flameshot"
cask "font-dejavu"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monoid-nerd-font"
cask "font-noto-color-emoji"
cask "font-sauce-code-pro-nerd-font"
cask "gimp"
cask "hammerspoon"
cask "iterm2"
cask "joplin"
cask "keepassxc"
cask "kitty"
cask "mpv"
cask "openwebstart"
cask "rectangle"
cask "spotify"
cask "sublime-text"
cask "tigervnc-viewer"
cask "tunnelblick"
cask "vlc"
cask "vscodium"

# vim: ft=conf
